# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 0s [id=staging_gateway_api_endpoint]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_PyBTAvZ9aVdAkQ4a9dkWI3wSHHWX]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_4uaTcUJtXSVqyzra9QaztRwSVPhV]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "staging-web-pink.vercel.app",
          - "staging-web-connectilly.vercel.app",
          - "staging-web-mortezaalizadeh-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common/outputs.tf"             = "61~2af7d6c0082ab664fb735558236323cc2f8d1054" -> "137~120b38333e73fdc7b2fcd392bf0e86abfb55ff31"
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf" = "964~c7529b7ac80e0facf6c7c0f0b5167af0fc2eef88" -> "1094~02996ab851d84e28760cf8f4b52939c8dde35387"
            # (30 unchanged elements hidden)
        }
      ~ id          = "dpl_4uaTcUJtXSVqyzra9QaztRwSVPhV" -> (known after apply)
      ~ url         = "staging-diqt5fkrx-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project_domain.default will be created
  + resource "vercel_project_domain" "default" {
      + domain     = "new-staging.connectilly.com"
      + id         = (known after apply)
      + project_id = "prj_PyBTAvZ9aVdAkQ4a9dkWI3wSHHWX"
      + team_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*